<?php require ('lib/top.php'); ?>

    <!-- 회사 정보 배너 시작 -->
    <div class="page-title-area" id="about">
        <div class="container">
            <div class="page-title-content">
                <h2>会社情報</h2>
            </div>
        </div>
    </div>
    <!-- //회사 정보 배너 종료 -->

    <!-- 회사 재무 지표 화면 시작 -->
    <section id="services">
        
        <div class = "container">
            <h3 class="FinancialStatements-title">連結財務諸表</h3>
            <p class="FinancialStatements-text">(単位 : ワォン)</p>
            <table class="table">
                <thead>
                    <tr>
                        <th rowspan="2">区分</th>
                        <th colspan="1">第8期</th>
                        <th colspan="1">第7期</th>
                        <th colspan="1">第6期</th>
                        <th colspan="1">第5期</th>
                    </tr>
                    <tr>
                        <th>2022年 06月末</th>
                        <th>2021年 12月末</th>
                        <th>2020年 12月末</th>
                        <th>2019年 12月末</th>
                       
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <th>流動資産</th>
                        <td>769,708,163,752</td>
                        <td>547,400,118,223</td>
                        <td>337,308,262,203</td>
                        <td>232,840,406,573</td>
                       
                    </tr>
                    <tr>
                        <th>非流動資産</th>
                        <td>169,560,738,370</td>
                        <td>163,545,990,618</td>
                        <td>117,086,478,495</td>
                        <td>108,842,646,637</td>
                    </tr>
                    <tr>
                        <th>資産総計</th>
                        <td>939,268,902,122</td>
                        <td>710,946,108,841</td>
                        <td>454,394,740,698</td>
                        <td>341,683,053,210</td>
                       
                    </tr>
                    <tr>
                        <th>流動負債</th>
                        <td>570,703,096,155</td>
                        <td>401,555,784,850</td>
                        <td>320,970,744,600</td>
                        <td>262,586,159,158</td>
                       
                    </tr>
                    <tr>
                        <th>非流動負債</th>
                        <td>78,536,849,045</td>
                        <td>41,081,120,757</td>
                        <td>16,736,554,450</td>
                        <td>15,926,808,152</td>
                    </tr>
                    <tr>
                        <th>負債総計</th>
                        <td>649,239,945,200</td>
                        <td>442,636,905,607</td>
                        <td>337,707,299,050</td>
                        <td>278,512,967,310</td>
                    </tr>
                    <tr>
                        <th>資本金</th>
                        <td>25,002,775,500</td>
                        <td>25,002,775,500</td>
                        <td>19,966,110,000</td>
                        <td>18,886,110,000</td>
                       
                    </tr>
                    <tr>
                        <th>利益剰余金</th>
                        <td>190,245,666,415</td>
                        <td>170,382,984,164</td>
                        <td>56,625,702,695</td>
                        <td>17,740,429,976</td>
                    </tr>
                    <tr>
                        <th>総資本</th>
                        <td>290,028,956,922</td>
                        <td>268,309,203,234</td>
                        <td>116,687,441,648</td>
                        <td>63,170,085,900</td>
                    </tr>
                </tbody>
              </table>
        </div>
    </section>
    <!-- 회사 재무 지표 화면 시작 -->

    <!-- 분기별 회사 손익 계산서 화면 시작 -->
    <section>
        <div class = "container">
            <h3 class="FinancialStatements-title">連結損益計算書</h3>
            <p class="FinancialStatements-text">(単位 : ワォン)</p>
            <table class="table">
                <thead>
                    <tr>
                        <th rowspan="2">区分</th>
                        <th colspan="1">第8期 半期</th>
                        <th colspan="1">第7期</th>
                        <th colspan="1">第6期</th>
                        <th colspan="1">第5期</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <th>売上高</th>
                        <td>810,122,680,040</td>
                        <td>1,153,250,200,869</td>
                        <td>1,076,474,322,659</td>
                        <td>913,607,360,717</td>
                    </tr>
                    <tr>
                        <th>売上原価</th>
                        <td>711,514,189,255</td>
                        <td>1,018,781,755,092</td>
                        <td>917,346,609,156</td>
                        <td>764,427,417,340</td>
                    </tr>
                    <tr>
                        <th>売上総利益</th>
                        <td>98,608,490,785</td>
                        <td>134,468,445,777</td>
                        <td>159,127,713,503</td>
                        <td>149,179,943,377</td>
                       
                    </tr>
                    <tr>
                        <th>販売費及び一般管理費</th>
                        <td>63,537,555,705</td>
                        <td>107,952,025,631</td>
                        <td>102,695,725,140</td>
                        <td>97,864,336,632</td>
                    </tr>
                    <tr>
                        <th>営業利益</th>
                        <td>35,070,935,080</td>
                        <td>26,516,420,146</td>
                        <td>56,431,988,363</td>
                        <td>51,315,606,745</td>
                       
                    </tr>
                    <tr>
                        <th>金融売上</th>
                        <td>1,241,163,299</td>
                        <td>2,299,325,013</td>
                        <td>1,500,534,893</td>
                        <td>1,178,730,191</td>
                    </tr>
                    <tr>
                        <th>金融収支</th>
                        <td>7,409,182,423</td>
                        <td>7,825,073,596</td>
                        <td>8,055,114,427</td>
                        <td>12,891,716,225</td>
                    </tr>
                    <tr>
                        <th>その他の収益</th>
                        <td>25,768,146,998</td>
                        <td>29,702,425,158</td>
                        <td>26,427,022,577</td>
                        <td>28,296,475,699</td>
                       
                    </tr>
                    <tr>
                        <th>その他のコスト</th>
                        <td>26,809,838,411</td>
                        <td>24,968,253,192</td>
                        <td>34,317,708,831</td>
                        <td>26,983,250,473</td>
                       
                    </tr>
                    <tr>
                        <th>관계기업투자지분법손실</th>
                        <td></td>
                        <td></td>
                        <td></td>
                        <td>656,179,030</td>
                        
                    </tr>
                    <tr>
                        <th>法人税前純利益</th>
                        <td>27,861,224,543</td>
                        <td>25,724,843,529</td>
                        <td>41,986,722,575</td>
                        <td>40,259,666,907</td>
                      
                       
                    </tr>
                    <tr>
                        <th>法人税</th>
                        <td>8,318,220,940</td>
                        <td>12,401,195,491</td>
                        <td>3,079,785,649</td>
                        <td>1,777,058,134</td>
                       
                    </tr>
                    <tr>
                        <th>当期純利益</th>
                        <td>19,543,003,603</td>
                        <td>13,323,648,038</td>
                        <td>38,906,936,926</td>
                        <td>38,482,608,773</td>
                       
                    </tr>
                    <tr>
                        <th>その他の包括利益</th>
                        <td>5,324,111,779</td>
                        <td>5,013,163,738</td>
                        <td>-4,219,294,524</td>
                        <td>-825,174,242</td>
                        
                       
                    </tr>
                    <tr>
                        <th>総包括利益</th>
                        <td>24,867,115,382</td>
                        <td>18,336,811,776</td>
                        <td>34,687,642,402</td>
                        <td>37,657,434,531</td>
                       
                    </tr>
                </tbody>
              </table>
        </div>
    </section>
    <!-- // 분기별 회사 손익 계산서 화면 시작 -->

      
    <!-- 분기별 회사 연결 현금 흐름표 화면 시작 -->
    <section>
        <div class = "container">
            <h3 class="FinancialStatements-title">キャッシュフロー計算書</h3>
            <p class="FinancialStatements-text">(単位 : ワォン)</p>
            <table class="table">
                <thead>
                    <tr>
                        <th rowspan="1">区分</th>
                        <th colspan="1">第8期 半期</th>
                        <th colspan="1">第7期</th>
                        <th colspan="1">第6期</th>
                        <th colspan="1">第5期</th>
                    </tr>
                   
                </thead>
                <tbody>
                    <tr>
                        <th>営業活動 キャッシュフロー計算書</th>
                        <td>-49,877,387,794</td>
                        <td>-178,873,116,805</td>
                        <td>42,040,476,523</td>
                        <td>90,722,709,465</td>
                    </tr>
                    <tr>
                        <th>投資活動 キャッシュフロー計算書</th>
                        <td>-26,904,839,670</td>
                        <td>-63,613,571,047</td>
                        <td>-57,415,205,147</td>
                        <td>-21,734,933,862</td>
                    </tr>
                    <tr>
                        <th>金融活動 キャッシュフロー計算書</th>
                        <td>67,658,191,524</td>
                        <td>219,029,140,502</td>
                        <td>26,094,823,255</td>
                        <td>-37,538,134,524</td>
                    </tr>
                    <tr>
                        <th>외화표시 현금및현금성자산의 <br>환율변동효과</th>
                        <td>19,186,605,500</td>
                        <td>8,834,222,276</td>
                        <td>-2,611,664,276</td>
                        <td>-1,259,093,072</td>
                    </tr>
                    <tr>
                        <th>現金及び現金同等物の増減額</th>
                        <td>10,062,569,560</td>
                        <td>-14,623,325,074</td>
                        <td>8,108,430,355</td>
                        <td>30,190,548,007</td>
                    </tr>
                    <tr>
                        <th>現金および現金同等(期間の開始)</th>
                        <td>52,666,998,966</td>
                        <td>67,290,324,040</td>
                        <td>59,181,893,685</td>
                        <td>28,991,345,678</td>
                    </tr>
                    <tr>
                        <th>現金および現金同等(期間の終了)</th>
                        <td>62,729,568,526</td>
                        <td>52,666,998,966</td>
                        <td>67,290,324,040</td>
                        <td>59,181,893,685</td>
                    </tr>
                </tbody>
              </table>
        </div>
    </section>
    <!-- // 분기별 회사 연결 현금 흐름표 화면 시작 -->

    
<?php require ('lib/bottom.php'); ?>  